cfg/InformationRegisters/СведенияОПенсионерах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СведенияОПенсионерах</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пенсионер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвидетельствоСерия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвидетельствоНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвидетельствоДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfg/InformationRegisters/СведенияОПенсионерах/Forms/ФормаЗаписи/Ext/Form/Module.bsl
Перем мФизЛицо; // сохраняем физлицо, данные которого начинали редактировать

Процедура УстановитьДоступность()
	
	ЭлементыФормы.СвидетельствоСерия.Доступность = Пенсионер;
	ЭлементыФормы.СвидетельствоНомер.Доступность = Пенсионер;
	ЭлементыФормы.СвидетельствоДатаВыдачи.Доступность = Пенсионер;
	
КонецПроцедуры	

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПриОткрытии()
	
	Заголовок = НСтр("ru='Сведения о пенсионерах: ';uk='Відомості про пенсіонерів: '") + ФизЛицо.Наименование;
	мФизЛицо = ФизЛицо;
КонецПроцедуры

Процедура ПослеЗаписи()
	Оповестить("ОбновитьФорму", Новый Структура("ИмяЭлемента","Пенсионеры"), ФизЛицо);
	Если мФизЛицо <> ФизЛицо Тогда
        // оповестим также форму того физлица, данные которого начинали редактировать
		Оповестить("ОбновитьФорму", Новый Структура("ИмяЭлемента","Пенсионеры"), мФизЛицо);
		мФизЛицо = ФизЛицо;
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

Процедура ПериодПриИзменении(Элемент)
	Если Элемент.Значение > РабочаяДата Тогда
		Ответ = Вопрос(НСтр("ru='Вы действительно хотите ввести данные';uk='Ви дійсно хочете ввести дані'") + Символы.ПС + НСтр("ru='о пенсионере на будущую дату?';uk='про пенсіонера на майбутню дату?'"), РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Элемент.Значение = РабочаяДата
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ФизЛицоПриИзменении(Элемент)
	Заголовок = НСтр("ru='Сведения об инвалидности: ';uk='Відомості про інвалідність: '") + Элемент.Значение.Наименование
КонецПроцедуры

Процедура ПенсионерПриИзменении(Элемент)
	
	Если НЕ Пенсионер Тогда
		СвидетельствоСерия = "";
		СвидетельствоНомер = "";
		СвидетельствоДатаВыдачи = "";
	КонецЕсли;
	
	УстановитьДоступность();
		
КонецПроцедуры
